attacker/data/filtering+scaling+sio/spoofing/ab_results/ab_90.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        108 bytes

Concurrency Level:      10
Time taken for tests:   189.481 seconds
Complete requests:      20
Failed requests:        18
   (Connect: 0, Receive: 0, Length: 18, Exceptions: 0)
Non-2xx responses:      7
Keep-Alive requests:    13
Total transferred:      4424 bytes
HTML transferred:       1916 bytes
Requests per second:    0.11 [#/sec] (mean)
Time per request:       94740.588 [ms] (mean)
Time per request:       9474.059 [ms] (mean, across all concurrent requests)
Transfer rate:          0.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   3.2      5       7
Processing:   113 39031 55321.4    299  120039
Waiting:      112 39031 55321.3    299  120039
Total:        113 39034 55321.3    306  120039

Percentage of the requests served within a certain time (ms)
  50%    306
  66%  69135
  75%  120024
  80%  120032
  90%  120033
  95%  120039
  98%  120039
  99%  120039
 100%  120039 (longest request)
